src/main/resources/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:AddInteger>
            <tem:Arg1>1</tem:Arg1>
            <tem:Arg2>9</tem:Arg2>
        </tem:AddInteger>
    </soapenv:Body>
</soapenv:Envelope>