Folder/soap.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <AddInteger xmlns="http://tempuri.org">
            <Arg1>[long?]</Arg1>
            <Arg2>[long?]</Arg2>
        </AddInteger>
    </Body>
</Envelope>